In [36]:
import pandas as pd

# load data 

# data = pd.read_csv("https://raw.githubusercontent.com/Pankaj-Str/Complete-Python-Mastery/refs/heads/main/53%20DataSet/credit_card_transactions.csv")

data = pd.read_csv("credit_card_transactions.csv")

data.head()

,Transaction_ID,Customer_ID,Transaction_Date,Transaction_Type,Merchant,Category,Amount,Payment_Mode,Transaction_Status,Location
0,100000,4452.0,2023-01-01,Online,Walmart,Travel,4520.70,Debit Card,Approved,Jonesport
1,100001,2775.0,2023-01-01,ATM,BestBuy,Travel,1437.85,Debit Card,Approved,Port Jennifer
2,100002,2259.0,2023-01-01,Mobile Payment,Uber,Clothing,3320.52,PayPal,NaN,Port James
3,100003,4545.0,2023-01-01,Online,BestBuy,Travel,2659.96,Debit Card,Approved,Hawkinston
4,100004,2137.0,2023-01-01,ATM,Amazon,Travel,2517.07,Debit Card,Approved,Matthewland

In [37]:
# Check the shape, column names, and summary statistics of the dataset.

data.shape

(5500, 10)

In [38]:
# check column 
data.columns.to_list()

['Transaction_ID',
 'Customer_ID',
 'Transaction_Date',
 'Transaction_Type',
 'Merchant',
 'Category',
 'Amount',
 'Payment_Mode',
 'Transaction_Status',
 'Location']

In [39]:
# summary statistics
data.describe()

       Transaction_ID  Customer_ID       Amount
count     5500.000000  5499.000000  5500.000000
mean    102749.500000  2989.767776  2492.109224
std       1587.857571  1153.950996  1444.493842
min     100000.000000  1000.000000     6.550000
25%     101374.750000  1988.000000  1236.935000
50%     102749.500000  2999.000000  2502.405000
75%     104124.250000  3989.500000  3767.957500
max     105499.000000  4998.000000  4997.490000

In [40]:
# check type 
data.dtypes

Transaction_ID          int64
Customer_ID           float64
Transaction_Date       object
Transaction_Type       object
Merchant               object
Category               object
Amount                float64
Payment_Mode           object
Transaction_Status     object
Location               object
dtype: object

In [41]:
data['Transaction_Date'] = pd.to_datetime(data['Transaction_Date'])

In [42]:
data.dtypes

Transaction_ID                 int64
Customer_ID                  float64
Transaction_Date      datetime64[ns]
Transaction_Type              object
Merchant                      object
Category                      object
Amount                       float64
Payment_Mode                  object
Transaction_Status            object
Location                      object
dtype: object

In [43]:
data.isnull().sum()

Transaction_ID        0
Customer_ID           1
Transaction_Date      0
Transaction_Type      0
Merchant              1
Category              0
Amount                0
Payment_Mode          0
Transaction_Status    4
Location              1
dtype: int64

In [46]:
data['Transaction_Status'] = data['Transaction_Status'].fillna('Unknwon')

In [47]:
data.isnull().sum()

Transaction_ID        0
Customer_ID           1
Transaction_Date      0
Transaction_Type      0
Merchant              1
Category              0
Amount                0
Payment_Mode          0
Transaction_Status    0
Location              1
dtype: int64

In [51]:
data['month']  = data['Transaction_Date'].dt.month
data['day'] = data['Transaction_Date'].dt.day
data['year'] = data['Transaction_Date'].dt.year

In [52]:
data.columns.to_list()

['Transaction_ID',
 'Customer_ID',
 'Transaction_Date',
 'Transaction_Type',
 'Merchant',
 'Category',
 'Amount',
 'Payment_Mode',
 'Transaction_Status',
 'Location',
 'year',
 'month',
 'day']

In [53]:
data.head()

,Transaction_ID,Customer_ID,Transaction_Date,Transaction_Type,Merchant,Category,Amount,Payment_Mode,Transaction_Status,Location,year,month,day
0,100000,4452.0,2023-01-01,Online,Walmart,Travel,4520.70,Debit Card,Approved,Jonesport,2023,1,1
1,100001,2775.0,2023-01-01,ATM,BestBuy,Travel,1437.85,Debit Card,Approved,Port Jennifer,2023,1,1
2,100002,2259.0,2023-01-01,Mobile Payment,Uber,Clothing,3320.52,PayPal,Unknwon,Port James,2023,1,1
3,100003,4545.0,2023-01-01,Online,BestBuy,Travel,2659.96,Debit Card,Approved,Hawkinston,2023,1,1
4,100004,2137.0,2023-01-01,ATM,Amazon,Travel,2517.07,Debit Card,Approved,Matthewland,2023,1,1